"Close" = "Isara";

"Scan Card" = "I-scan ang kard";

"Scan card" = "I-scan ang kard";

"The IBAN you entered is invalid." = "Ang IBAN na iniligay mo ay imbalido.";

"There was an error processing your card -- try again in a few seconds" = "Nagkaroon ng kamalian sa pagproseso ng iyong kard -- subukin muli sa ilang segundo";

"There was an unexpected error -- try again in a few seconds" = "Nagkaroon ng di-inaasahang kamalian -- subukin muli sa ilang segundo";

"Try again" = "Subukan muli";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Gumagamit kami ng Stripe para i-verify ang mga detalye ng iyong kard. Maaaring gamitin at imbakin ng Stripe ang iyong data ayon sa patakaran sa privacy nito. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Alamin ang higit pa</u></a>";

"Your card has expired" = "Napaso na ang iyong kard";

"Your card was declined" = "Tinanggihan ang iyong kard";

"Your card's expiration month is invalid" = "Ang buwan ng pagkapaso ng iyong kard ay di balido";

"Your card's expiration year is invalid" = "Ang taon ng pagkapaso ng iyong kard ay di balido";

"Your card's number is invalid" = "Ang numero ng iyong kard ay di balido";

"Your card's security code is invalid" = "Ang security code ng iyong kard ay di balido";

"Your name is invalid." = "Ang iyong pangalan ay imbalido.";

"Your payment method was declined." = "Tinanggihan ang iyong paraan ng pagbabayad.";
